{
    "ratings": [
        {"critic": "David Koh", "type":"Energy", "flavor": "Original", "rating": 0.60, "review": "Classic fuel flavor. When you're in a pickle you can't go wrong with this. (carbonated)" },
        {"critic": "William Chung", "type":"Energy", "flavor": "Original", "rating": 0.60, "review": "You can never go wrong with original." },
        {"critic": "David Koh", "type":"Energy", "flavor": "Original Zero Sugar", "rating": -3, "review": "I realized I never tried the original zero sugar because there are so many different options but I wished that my curiosity didn't get the best of me. This thing is absolutely trash. It takes the worst of the original monster and the worst of the zero sugar drinks and put them together. I took this to pull an all nighter for a midterm because I didn't watch a single lecture for the past 4 weeks but I would rather fall asleep or work on pure willpower alone than drink this. (carbonated)" },
        {"critic": "William Chung", "type":"Energy", "flavor": "Original Zero Sugar", "rating": -0.2, "review": "The geniuses at Monster really looked at their original and said \"Yeah customers would want a zero-sugar version\"? Nah this is an absolute abomination, and I wouldn't be too surprised that this flavor only fairs well with obese fucks who think that a zero-sugar energy drink is what's keeping them alive. People who drink and enjoy the zero-sugar version are the type of fuckers who would drink a diet pepsi and say \"This is great! I absolutely feel like I'm on a diet\" when in reality, they're 2 fries away from the most painful heart attack known to man. I genuinely believe feeding this to a prisoner of war as a replacement for water is something that even Satan himself wouldn't do. There ya go CIA/FBI, I just gave you a new torture method, use it wisely." },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Watermelon", "rating": 0.55, "review": "This tastes like a watered down watermelon jolly rancher, however it is very sweet and it leaves your mouth with that sugary feeling. (carbonated)" },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Watermelon", "rating": -100, "review": "Never tried" },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Strawberry Dreams", "rating": 0.55, "review": "This tastes like multi-vitamin gummy bears. You start pleasantly surprised with the drink and like it at the beginning but just like them gummy bears you eat too many and you start feeling sick of it. (carbonated)" },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Strawberry Dreams", "rating": 0.60, "review": "I'm not gonna lie, the can is slightly deceiving. Just think \"Hello-Kitty girl\". Its extremely nice and sweet appearance lulls you into a false sense of confidence, and buddy, if you thought you were the one that could \"fix her\", think again. Not only is this drink sweet, but that taste of strawberry is so quickly diminished by the strong carbonation and all the other ingredients, it's not even funny." },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Violet", "rating": 0.55, "review": "This tastes like grape and fruit-punch caprisun mixed. Remember though that this is still a zero sugar drink. That automatically gives it a nerf. Quite honestly I would almost never recommend a zero sugar monster. (carbonated)" },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Violet", "rating": -100, "review": "Never tried" },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Sunrise", "rating": 0.2, "review": "This tastes like vitamin c powder that you buy in bulk from costco. Gives me PTSD from everytime I would get sick and my mom would feed me 5 month expired vitamin c powder because in her eyes if it look and smell ok then it is ok. I swear I would be on the verge of throwing up everytime I would have to ingest that concoction and this drink reminds me of that exact taste. Would not recommend. (carbonated) " },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Sunrise", "rating": 0.001, "review": "FUCK NO. You know that feeling, when you have really bad tonsillitis, and you're forced to drink those vitamin-C drinks to boost your immune system, but instead of helping you, all it does is burn the back of your already sore throat? Yeah, think that, except, like a million times worse. Like, I'm already sick and feeling like shit from studying and working with 0-4 hours of sleep, WHY DAFUQ WOULD I DO THAT TO MY OWN BODY. Anybody who enjoys drinking this shit is genuinely a psychopath, and you gotta watch out for them if you can 👀." },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Fiesta Mango", "rating": 0.50, "review": "" },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Fiesta Mango", "rating": 0.40, "review": "Yeah I'm not so sure about this one chief. It says fiesta, but ain't no party going down. In fact, nobody drinking this is going to any parties. If you enjoy this drink, you're likely a construction worker, or a basement dweller. There is absolutely no in-between." },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Paradise", "rating": 0.50, "review": "A little bit of apple and pineapple. A little fruity like the bois, and it hits the tongue with that little bit of sour power." },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Paradise", "rating": -100, "review": "Never tried, but wtf is that review from David?" },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Peachy Keen", "rating": 0.70, "review": "The peach flavor tastes almost like that peachy korean candy IYKYK. Honestly this tastes really good. It is sweet without feeling sweet but idk if thats because I am sleep deprived, physically tired from driving, and haven't eaten a meal in about 14 hours." },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Peachy Keen", "rating": 0.60, "review": "Being absolutely honest, it really isn't that bad. I'd say the first time you try it, it hits, but its kinda like masturbation. That first feeling makes you feel like you just discovered fire. But as you mature, you realize there are way better peach flavored drinks out there for you that will cuddle you, listen to you, buy you gifts, and make you feel good, but they're too expensive, so this is all you've got. What I'm trying to say is, you get really tired of this flavor pretty quickly, but I've never had a girlfriend, so what would I know?" },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Vice Guava", "rating": -100, "review": "Never tried" },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Vice Guava", "rating": 0.58, "review": "Yea, I'm not entirely too sure about this one. I was really excited because of the whole \"vice city\" collab, but this just feels basic. What I mean by that is, you get the kick of guava right at the beginning, and then it just disappears, leaving you with that familiar taste that all these monster zero sugar drinks have. That's why I was hesitant on giving out the full score. Like the guava aspect, but the rest of the drink quickly nulls everything. It's kinda just like banging your good friend (Ian for me) with a condom, except when you're both finished, both of you just lay there like \"damn that's it?\" because there was really no excitement in the climax due to the condom cock blocking everything. Disappointing to say the least, especially since the presentation of the can itself really lures you into a false sense of high expectation. Doesn't deserve anything above a 6 in my professional opinion, but it's worth trying at least once. " },
        {"critic": "David Koh", "type":"Ultra", "flavor": "Ultra Fantasy Ruby Red", "rating": -100, "review": "Never tried" },
        {"critic": "William Chung", "type":"Ultra", "flavor": "Ultra Fantasy Ruby Red", "rating": 0.001, "review": "WTAF bro. Nah, my apologies to the Ultra Vice Guava cus wtaf. The presentation of this can was absurdly luring, but its just a WORSE guava drink than the Vice Guava?! And also, does Monster not realize that the color of guava is NOT red, pink, and blue? You know what this shit is? It's like taking the most breathtaking girl you see on a date, taking her ass back home, and then finding out she has a penis. Bro I had to finish the can out of guilt to my debit card, like NAH dawg this one ain't it." },
        {"critic": "David Koh", "type":"Juice", "flavor": "Aussie Lemonade", "rating": 0.8, "review": "Going off of memory here, but it tastes like an energy drink version of brisk. I'm 50% sure it was carbonated, but I was driving while drinking this so....." },
        {"critic": "William Chung", "type":"Juice", "flavor": "Aussie Lemonade", "rating": -100, "review": "Never tried" },
        {"critic": "David Koh", "type":"Juice", "flavor": "Pipeline Punch", "rating": 0.55, "review": "It's pretty mid. It tastes like capri sun but when you're 4 pouches in, plus, it's carbonated." },
        {"critic": "William Chung", "type":"Juice", "flavor": "Pipeline Punch", "rating": -100, "review": "Never tried" },
        {"critic": "David Koh", "type":"Juice", "flavor": "Mango Loco", "rating": -100, "review": "Never tried" },
        {"critic": "William Chung", "type":"Juice", "flavor": "Mango Loco", "rating": 0.5, "review": "Alright the entire juice line feels like it was made to satisfy the taste buds of a 10 year old scooter boy who never washed their hands. Extremely fucking sweet, and I can genuinely feel my heart beating out of my fucking rib cage when drinking this. I'm not a big fan of either this or the fiesta mango, but if I had to fucking choose a mango flavored energy drink, it's definitely not this one. Carbonated (I have no idea why this line is called juice if it's all carbonated), tastes like super sweet mango snapple or the trident mango gum, and quite frankly, if your grandma or grandpa flat-lines and all seems lost, do yourself a favor: don't give them cpr, just pour this drink into their mouths and I guarantee you their hearts will jump-start again." },
        {"critic": "David Koh", "type":"Juice", "flavor": "Pacific Punch", "rating": -100, "review": "Never tried" },
        {"critic": "William Chung", "type":"Juice", "flavor": "Pacific Punch", "rating": 0.6, "review": "This is Monster's attempt at a Hawaiian punch, and sure while it's not terrible, holy fuck is it sweet as hell. Some people will like this, and I say that's fine, but if one drink can give me 10 cavities simultaneously, I'm not too keen on drinking this on a daily basis, even IF I have a shit ton of work to do. Carbonated (once again I have no idea why this line is called juice if it's all carbonated), if you wanna drink hawaiian punch and stress test your cardiovascular system at the same time, then I guess this is the drink for you." },
        {"critic": "David Koh", "type":"Tea", "flavor": "Tea Lemonade", "rating": 0.8, "review": "This drink is really good. I think the name tea lemonade is true to flavor while also giving you the benefit of the nice caffeine boost that you crave for when you pick up a monster. If I can't pick up a wild berry tea then this is my next go-to." },
        {"critic": "William Chung", "type":"Tea", "flavor": "Tea Lemonade", "rating": 0.8, "review": "This is where it's at. Compared to the rest of the Monster drinks, this one isn't as sweet, but it gives you a slight kick that doesn't last till the next day. Non carbonated, and tastes like a sweeter version of Arizona's Arnold Palmer drink (which is arguably my favorite)" },
        {"critic": "David Koh", "type":"Tea", "flavor": "Wild Berry Tea", "rating": 1.0, "review": "Totally unbiased opinion but it tastes like my go to order at teacision: blackberry black tea. Absolutely goated drink, non-carbonated, and 10/10 would buy again." },
        {"critic": "William Chung", "type":"Tea", "flavor": "Wild Berry Tea", "rating": -100, "review": "Never tried" },
        {"critic": "David Koh", "type":"Tea", "flavor": "Peach Tea", "rating": 0.75, "review": "The flavor itself is very light. There is a bit of that signature artificial peach flavor that we all love but there is also a distinct flavor of \"energy drink\" that is not quite masked as well as I would've enjoyed." },
        {"critic": "William Chung", "type":"Tea", "flavor": "Peach Tea", "rating": -100, "review": "Never tried" },       
        {"critic": "David Koh", "type":"Tea", "flavor": "Green Tea", "rating": 0.75, "review": "If you chose this because you're an oriental and love your green tea then think again. This is monsters attempt at culturally appropriating us asians because the way that the sugary sweetness hit my tongue was an insulting to us tea lovers. HOWEVER putting all that aside the drink is not bad LOL. I will always be a rehab monster glazer. Everything in this line of monster is far superior to any other flavor you can pick up." },
        {"critic": "William Chung", "type":"Tea", "flavor": "Green Tea", "rating": -100, "review": "Never tried" }, 
        {"critic": "David Koh", "type":"Reserve", "flavor": "Watermelon", "rating": 0.7, "review": "Tastes like juiced up watermelon candy. You can feel the energy hit your tongue and zap around. Honestly, good for the first time, not that nice for twice. It's non-carbonated though." },
        {"critic": "William Chung", "type":"Reserve", "flavor": "Watermelon", "rating": -100, "review": "Never tried" },
        {"critic": "David Koh", "type":"Reserve", "flavor": "Orange Dreamsicle", "rating": 0, "review": "This shi- disgusting. WTF, I wouldn't even feed this to my sugar granny even if it meant she would pass sooner, leaving me with a fat inheritance. Honestly I've never been a fan of creamy drinks so idk why I expected to think that this would be any different. That “cream” flavor is really strong. No bueno." },
        {"critic": "William Chung", "type":"Reserve", "flavor": "Orange Dreamsicle", "rating": -100, "review": "Never tried, but I'll take David's word for it." },
        {"critic": "David Koh", "type":"Reserve", "flavor": "White Pineapple", "rating": -100, "review": "Never tried" },
        {"critic": "William Chung", "type":"Reserve", "flavor": "White Pineapple", "rating": 0.7, "review": "I ain't gon lie this one's actually not that bad. Kinda tastes like pineapple fanta but less of the fanta, if that makes sense. It's carbonated, and it feels like a good combo to when you're at the park and having a pizza party with your friends, flavor wise. Of course, all of you are gonna have elevated heart rates so who knows what will happen between you and your homies ;)." },
        {"critic": "David Koh", "type":"Reserve", "flavor": "Strawberry Lemonade", "rating": 0.85, "review": "Kinda like strawberry fanta. Feels like the same syrup. Solid sweet drink." },
        {"critic": "William Chung", "type":"Reserve", "flavor": "Strawberry Lemonade", "rating": 1.0, "review": "This is chef's kiss. This is my version of a Wendy drink if it ever existed. The person who thought of this deserves a Nobel Peace Prize for his contributions to humanity. If I could, I would drink this drink and give the creator of this a nice strawberry and lemonade blowjob. Holy fuck this shit is soooo good. I would argue that this flavor ranks in the top 5 of any drinks I've ever had in my life. This drink has given me a new perspective on Strawberry Lemonade, so much so, that I have convinced myself that if my future SO doesn't have a strawberry lemonade lipstick on and ain't kissing me with that scent, I will do humanity a favor and just get rid of their existence on this planet. Non carbonated, and is just the definition of perfection. I promise you Merriam Webster will change their definition of perfection from \"the quality or state of being perfect\" to just \"Monster Strawberry Lemonade Rehab\"." }
    ],
    "colors": [
        {"flavor": "Original", "colorOne": "#00CD4F", "colorTwo": "#00CD4F"},
        {"flavor": "Original Zero Sugar", "colorOne": "#00CD4F", "colorTwo": "#00CD4F"},
        {"flavor": "Ultra Watermelon", "colorOne": "#F83B47", "colorTwo": "#5D8F49"},
        {"flavor": "Ultra Strawberry Dreams", "colorOne": "#DFA3C5", "colorTwo": "#DFA3C5"},
        {"flavor": "Ultra Violet", "colorOne": "#562C79", "colorTwo": "#562C79"},
        {"flavor": "Ultra Sunrise", "colorOne": "#BC5710", "colorTwo": "#BC5710"},
        {"flavor": "Ultra Fiesta Mango", "colorOne": "#007984", "colorTwo": "#E1A96F"},
        {"flavor": "Ultra Paradise", "colorOne": "#6FB02E", "colorTwo": "#6FB02E"},
        {"flavor": "Ultra Peachy Keen", "colorOne": "#C88E78", "colorTwo": "#C88E78"},
        {"flavor": "Ultra Vice Guava", "colorOne": "#3DCCB9", "colorTwo": "#C8415E"},
        {"flavor": "Ultra Fantasy Ruby Red", "colorOne": "#E582B0", "colorTwo": "#6998C9"},
        {"flavor": "Aussie Lemonade", "colorOne": "#5165A2", "colorTwo": "#F6D742"},
        {"flavor": "Pipeline Punch", "colorOne": "#C73C65", "colorTwo": "#C73C65"},
        {"flavor": "Mango Loco", "colorOne": "#1FAEDB", "colorTwo": "#F6BB35"},
        {"flavor": "Pacific Punch", "colorOne": "#E7D1AC", "colorTwo": "#E41935"},
        {"flavor": "Tea Lemonade", "colorOne": "#FDE000", "colorTwo": "#FDE000"},
        {"flavor": "Wild Berry Tea", "colorOne": "#91295C", "colorTwo": "#3B7BA3"},
        {"flavor": "Peach Tea", "colorOne": "#E6904B", "colorTwo": "#E6904B"},
        {"flavor": "Green Tea", "colorOne": "#9FC535", "colorTwo": "#9FC535"},
        {"flavor": "Watermelon", "colorOne": "#E72B46", "colorTwo": "#E72B46"},
        {"flavor": "Orange Dreamsicle", "colorOne": "#B0A393", "colorTwo": "#F9EDAA"},
        {"flavor": "White Pineapple", "colorOne": "#FFF35C", "colorTwo": "#FFF35C"},
        {"flavor": "Strawberry Lemonade", "colorOne": "#E72231", "colorTwo": "#E72231"}
    ]
}
